#### ArrayLength Property

---

|  |
| --- |
| RebarShapeDrivenAccessor Class   See Also |

Identifies the distribution path length of rebar set.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public double ArrayLength { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ArrayLength As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double ArrayLength { 	double get (); 	void set (double value); } ``` |

#### Field Value

The distribution path length of rebar set.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: the set length arrayLength isn't acceptable. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |
| Autodesk.Revit.Exceptions InvalidOperationException | This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

# See Also

RebarShapeDrivenAccessor Class

Autodesk.Revit.DB.Structure Namespace